import {
  createMap,
  createPopup,
  pointermove,
  click,
  polygonFeatures,
  templatePolygonFeature,
  defaultStyle,
  highlightStyle,
  imageWidth,
  imageHeight,
  imageExtent,
  proj,
  vectorSource,
  show_schedule,
  vectorLayer,
  openModal,
  setupGlobalFilters,
} from '/index.js';

// лестницы
templatePolygonFeature(
  [
    [
      [1479, 1027],
      [1600, 1027],
      [1600, 944],
      [1479, 944],
      [1479, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs1',
);
templatePolygonFeature(
  [
    [
      [1604, 1001],
      [1769, 1001],
      [1769, 873],
      [1604, 873],
      [1604, 1001],
    ],
  ],
  'центральная лестница',
  'centralstairs2',
);
templatePolygonFeature(
  [
    [
      [1772, 1027],
      [1892, 1027],
      [1892, 944],
      [1772, 944],
      [1772, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs3',
);
templatePolygonFeature(
  [
    [
      [2494, 1088],
      [2637, 1088],
      [2637, 947],
      [2494, 947],
      [2494, 1088],
    ],
  ],
  'лестница',
  'rightstairs',
);
templatePolygonFeature(
  [
    [
      [2587, 1916],
      [2730, 1916],
      [2730, 1844],
      [2587, 1844],
      [2587, 1916],
    ],
  ],
  'лестница',
  'farrightstairs',
);
templatePolygonFeature(
  [
    [
      [737, 1079],
      [876, 1079],
      [876, 940],
      [737, 940],
      [737, 1079],
    ],
  ],
  'лестница',
  'leftstairs',
);
templatePolygonFeature(
  [
    [
      [133, 1548],
      [201, 1548],
      [201, 1468],
      [133, 1468],
      [133, 1548],
    ],
  ],
  'лестница',
  'farleftstairs1',
);
templatePolygonFeature(
  [
    [
      [62, 1466],
      [134, 1466],
      [134, 1398],
      [62, 1398],
      [62, 1466],
    ],
  ],
  'лестница',
  'farleftstairs2',
);
templatePolygonFeature(
  [
    [
      [131, 1396],
      [201, 1396],
      [201, 1320],
      [131, 1320],
      [131, 1396],
    ],
  ],
  'лестница',
  'farleftstairs3',
);
templatePolygonFeature(
  [
    [
      [1928, 1382],
      [2043, 1382],
      [2043, 1292],
      [1928, 1292],
      [1928, 1382],
    ],
  ],
  'лестница к спортзалу',
  'gymstairs',
);

// лифты
templatePolygonFeature(
  [
    [
      [643, 1122],
      [730, 1122],
      [730, 1024],
      [643, 1024],
      [643, 1122],
    ],
  ],
  'лифт',
  'elevator1',
);
templatePolygonFeature(
  [
    [
      [645, 887],
      [735, 887],
      [735, 790],
      [645, 790],
      [645, 887],
    ],
  ],
  'лифт',
  'elevator2',
);
templatePolygonFeature(
  [
    [
      [2642, 1123],
      [2729, 1123],
      [2729, 1027],
      [2642, 1027],
      [2642, 1123],
    ],
  ],
  'лифт',
  'elevator3',
);
templatePolygonFeature(
  [
    [
      [2638, 889],
      [2727, 889],
      [2727, 792],
      [2638, 792],
      [2638, 889],
    ],
  ],
  'лифт',
  'elevator4',
);

// туалеты
templatePolygonFeature(
  [
    [
      [637, 1320],
      [801, 1320],
      [801, 1136],
      [637, 1136],
      [637, 1320],
    ],
  ],
  '208 (ремонт)',
  'toilet1',
);
templatePolygonFeature(
  [
    [
      [2581, 1726],
      [2740, 1726],
      [2740, 1525],
      [2581, 1525],
      [2581, 1726],
    ],
  ],
  'туалет мужской',
  'toilet2',
);

// аудитории левого крыла
templatePolygonFeature(
  [
    [
      [178, 1320],
      [475, 1320],
      [475, 950],
      [178, 950],
      [178, 1320],
    ],
  ],
  '207 (кафедра философии культуры и культорологии, центр Артефакт)',
  '207',
);
templatePolygonFeature(
  [
    [
      [178, 947],
      [475, 947],
      [475, 832],
      [178, 832],
      [178, 947],
    ],
  ],
  '206 (совет студентов философского факультета)',
  '206',
);
templatePolygonFeature(
  [
    [
      [178, 828],
      [475, 828],
      [475, 602],
      [178, 602],
      [178, 828],
    ],
  ],
  '205 (кафедра теоретической и социальной философии, <br> учебно-научная лаборатория ЦИФРА)',
  '205',
);
templatePolygonFeature(
  [
    [
      [178, 600],
      [632, 600],
      [632, 373],
      [510, 373],
      [510, 250],
      [178, 250],
      [178, 600],
    ],
  ],
  '204 (деканат философского факультета)',
  '204',
);
templatePolygonFeature(
  [
    [
      [886, 1097],
      [1073, 1097],
      [1073, 778],
      [886, 778],
      [886, 1097],
    ],
  ],
  '209',
  '209',
);
templatePolygonFeature(
  [
    [
      [1076, 1097],
      [1244, 1097],
      [1244, 778],
      [1076, 778],
      [1076, 1097],
    ],
  ],
  '210',
  '210',
);
templatePolygonFeature(
  [
    [
      [1247, 1097],
      [1348, 1097],
      [1348, 778],
      [1247, 778],
      [1247, 1097],
    ],
  ],
  '211 (кафедра теологии и религиоведения)',
  '211',
);
templatePolygonFeature(
  [
    [
      [1351, 1097],
      [1458, 1097],
      [1458, 778],
      [1351, 778],
      [1351, 1097],
    ],
  ],
  '212 (заведующий кафедрой теологии и религиоведения)',
  '212',
);
templatePolygonFeature(
  [
    [
      [632, 631],
      [918, 631],
      [918, 373],
      [632, 373],
      [632, 631],
    ],
  ],
  '203 (лекционная аудитория им. А.Ф. Аскина)',
  '203',
);
templatePolygonFeature(
  [
    [
      [921, 631],
      [1163, 631],
      [1163, 373],
      [921, 373],
      [921, 631],
    ],
  ],
  '202 (лекционная аудитория им. С.Л. Франка)',
  '202',
);
templatePolygonFeature(
  [
    [
      [1166, 631],
      [1361, 631],
      [1361, 373],
      [1166, 373],
      [1166, 631],
    ],
  ],
  '201',
  '201',
);

// аудитории правого крыла
templatePolygonFeature(
  [
    [
      [1998, 635],
      [2230, 635],
      [2230, 373],
      [1998, 373],
      [1998, 635],
    ],
  ],
  '230 (лаборатория аудиовизуальных средств обучения, <br> компьютерный класс)',
  '230',
);
templatePolygonFeature(
  [
    [
      [2233, 635],
      [2504, 635],
      [2504, 373],
      [2233, 373],
      [2233, 635],
    ],
  ],
  '229 (лаборатория информационных <br> технологий 2, компьютерный класс)',
  '229',
);
templatePolygonFeature(
  [
    [
      [2507, 635],
      [2749, 635],
      [2749, 373],
      [2507, 373],
      [2507, 635],
    ],
  ],
  '228 (лаборатория информационных <br> технологий 1, компьютерный класс)',
  '228',
);
templatePolygonFeature(
  [
    [
      [1915, 1097],
      [2148, 1097],
      [2148, 778],
      [1915, 778],
      [1915, 1097],
    ],
  ],
  '215 (лаборатория информационных технологий 3, компьютерный класс)',
  '215',
);
templatePolygonFeature(
  [
    [
      [2151, 1097],
      [2300, 1097],
      [2300, 778],
      [2151, 778],
      [2151, 1097],
    ],
  ],
  '216 (лаборатория технической диагностики)',
  '216',
);
templatePolygonFeature(
  [
    [
      [2303, 1097],
      [2488, 1097],
      [2488, 778],
      [2303, 778],
      [2303, 1097],
    ],
  ],
  '217 (центр олимпиадной подготовки программистов <br> им. Н.Л. Андреевой, компьютерный класс)',
  '217',
);
templatePolygonFeature(
  [
    [
      [2894, 565],
      [3193, 565],
      [3193, 251],
      [2863, 251],
      [2863, 373],
      [2894, 373],
      [2894, 565],
    ],
  ],
  '227 (деканат <br> факультета ФМиЕНД (ПИ), <br> базовая кафедра <br> ГАОУ СО "ФТЛ лицей №1")',
  '227',
);
templatePolygonFeature(
  [
    [
      [2894, 568],
      [3193, 568],
      [3193, 929],
      [2894, 929],
      [2894, 568],
    ],
  ],
  '226 (базовые кафедры <br> Мирантис ИТ, филиала № 2 <br> ООО "РНТ")',
  '226',
);
templatePolygonFeature(
  [
    [
      [2894, 1318],
      [3193, 1318],
      [3193, 932],
      [2894, 932],
      [2894, 1318],
    ],
  ],
  '225 (кафедра системного <br> анализа и автоматического <br> управления)',
  '225',
);
templatePolygonFeature(
  [
    [
      [2894, 1550],
      [3310, 1550],
      [3310, 1320],
      [2894, 1320],
      [2894, 1550],
    ],
  ],
  '224 (лекционная аудитория)',
  '224',
);
templatePolygonFeature(
  [
    [
      [2894, 1628],
      [3193, 1628],
      [3193, 1552],
      [2894, 1552],
      [2894, 1628],
    ],
  ],
  '222',
  '222',
);
templatePolygonFeature(
  [
    [
      [2894, 1717],
      [3193, 1717],
      [3193, 1630],
      [2894, 1630],
      [2894, 1717],
    ],
  ],
  '221',
  '221',
);
templatePolygonFeature(
  [
    [
      [2894, 1948],
      [3315, 1948],
      [3315, 1719],
      [2894, 1719],
      [2894, 1948],
    ],
  ],
  '220 (лекционная аудитория)',
  '220',
);

const map = createMap('second_floor.svg');

const popup = createPopup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(2);
