import {
    create_map,
    create_popup,
    pointermove,
    click,
    polygonFeatures,
    template_polygon_feature,
    defaultStyle,
    highlightStyle,
    imageWidth,
    imageHeight,
    imageExtent,
    proj,
    vectorSource,
    show_schedule,
    vectorLayer,
    openModal,
    setupGlobalFilters
} from '/index.js';

const secondFloorCoordinates = {
  // лестницы
  "центральная лестница": [
    [[1479, 1027], [1600, 1027], [1600, 944], [1479, 944], [1479, 1027]],
    [[1604, 1001], [1769, 1001], [1769, 873], [1604, 873], [1604, 1001]],
    [[1772, 1027], [1892, 1027], [1892, 944], [1772, 944], [1772, 1027]]
  ],
  "лестница": [
    [[2494, 1088], [2637, 1088], [2637, 947], [2494, 947], [2494, 1088]],
    [[2587, 1916], [2730, 1916], [2730, 1844], [2587, 1844], [2587, 1916]],
    [[737, 1079], [876, 1079], [876, 940], [737, 940], [737, 1079]],
    [[133, 1548], [201, 1548], [201, 1468], [133, 1468], [133, 1548]],
    [[62, 1466], [134, 1466], [134, 1398], [62, 1398], [62, 1466]],
    [[131, 1396], [201, 1396], [201, 1320], [131, 1320], [131, 1396]]
  ],
  "лестница к спортзалу": [
    [[1928, 1382], [2043, 1382], [2043, 1292], [1928, 1292], [1928, 1382]]
  ],

  // лифты
  "лифт": [
    [[643, 1122], [730, 1122], [730, 1024], [643, 1024], [643, 1122]],
    [[645, 887], [735, 887], [735, 790], [645, 790], [645, 887]],
    [[2642, 1123], [2729, 1123], [2729, 1027], [2642, 1027], [2642, 1123]],
    [[2638, 889], [2727, 889], [2727, 792], [2638, 792], [2638, 889]]
  ],

  // туалеты
  "208 (ремонт)": [
    [[637, 1320], [801, 1320], [801, 1136], [637, 1136], [637, 1320]]
  ],
  "туалет мужской": [
    [[2581, 1726], [2740, 1726], [2740, 1525], [2581, 1525], [2581, 1726]]
  ],

  // аудитории левого крыла
  "207": [
    [[178, 1320], [475, 1320], [475, 950], [178, 950], [178, 1320]]
  ],
  "206": [
    [[178, 947], [475, 947], [475, 832], [178, 832], [178, 947]]
  ],
  "205": [
    [[178, 828], [475, 828], [475, 602], [178, 602], [178, 828]]
  ],
  "204": [
    [[178, 600], [632, 600], [632, 373], [510, 373], [510, 250], [178, 250], [178, 600]]
  ],
  "209": [
    [[886, 1097], [1073, 1097], [1073, 778], [886, 778], [886, 1097]]
  ],
  "210": [
    [[1076, 1097], [1244, 1097], [1244, 778], [1076, 778], [1076, 1097]]
  ],
  "211": [
    [[1247, 1097], [1348, 1097], [1348, 778], [1247, 778], [1247, 1097]]
  ],
  "212": [
    [[1351, 1097], [1458, 1097], [1458, 778], [1351, 778], [1351, 1097]]
  ],
  "203": [
    [[632, 631], [918, 631], [918, 373], [632, 373], [632, 631]]
  ],
  "202": [
    [[921, 631], [1163, 631], [1163, 373], [921, 373], [921, 631]]
  ],
  "201": [
    [[1166, 631], [1361, 631], [1361, 373], [1166, 373], [1166, 631]]
  ],

  // аудитории правого крыла
  "230": [
    [[1998, 635], [2230, 635], [2230, 373], [1998, 373], [1998, 635]]
  ],
  "229": [
    [[2233, 635], [2504, 635], [2504, 373], [2233, 373], [2233, 635]]
  ],
  "228": [
    [[2507, 635], [2749, 635], [2749, 373], [2507, 373], [2507, 635]]
  ],
  "215": [
    [[1915, 1097], [2148, 1097], [2148, 778], [1915, 778], [1915, 1097]]
  ],
  "216": [
    [[2151, 1097], [2300, 1097], [2300, 778], [2151, 778], [2151, 1097]]
  ],
  "217": [
    [[2303, 1097], [2488, 1097], [2488, 778], [2303, 778], [2303, 1097]]
  ],
  "227": [
    [[2894, 565], [3193, 565], [3193, 251], [2863, 251], [2863, 373], [2894, 373], [2894, 565]]
  ],
  "226": [
    [[2894, 568], [3193, 568], [3193, 929], [2894, 929], [2894, 568]]
  ],
  "225": [
    [[2894, 1318], [3193, 1318], [3193, 932], [2894, 932], [2894, 1318]]
  ],
  "224": [
    [[2894, 1550], [3310, 1550], [3310, 1320], [2894, 1320], [2894, 1550]]
  ],
  "222": [
    [[2894, 1628], [3193, 1628], [3193, 1552], [2894, 1552], [2894, 1628]]
  ],
  "221": [
    [[2894, 1717], [3193, 1717], [3193, 1630], [2894, 1630], [2894, 1717]]
  ],
  "220": [
    [[2894, 1948], [3315, 1948], [3315, 1719], [2894, 1719], [2894, 1948]]
  ]
};

// лестницы
template_polygon_feature([[[1479, 1027],[1600, 1027],[1600, 944],[1479, 944],[1479, 1027]]], 'центральная лестница', 'centralstairs1');
template_polygon_feature([[[1604, 1001],[1769, 1001],[1769, 873],[1604, 873],[1604, 1001]]], 'центральная лестница', 'centralstairs2');
template_polygon_feature([[[1772, 1027],[1892, 1027],[1892, 944],[1772, 944],[1772, 1027]]], 'центральная лестница', 'centralstairs3');
template_polygon_feature([[[2494, 1088],[2637, 1088],[2637, 947],[2494, 947],[2494, 1088]]], 'лестница', 'rightstairs');
template_polygon_feature([[[2587, 1916],[2730, 1916],[2730, 1844],[2587, 1844],[2587, 1916]]], 'лестница', 'farrightstairs');
template_polygon_feature([[[737, 1079],[876, 1079],[876, 940],[737, 940],[737, 1079]]], 'лестница', 'leftstairs');
template_polygon_feature([[[133, 1548],[201, 1548],[201, 1468],[133, 1468],[133, 1548]]], 'лестница', 'farleftstairs1');
template_polygon_feature([[[62, 1466],[134, 1466],[134, 1398],[62, 1398],[62, 1466]]], 'лестница', 'farleftstairs2');
template_polygon_feature([[[131, 1396],[201, 1396],[201, 1320],[131, 1320],[131, 1396]]], 'лестница', 'farleftstairs3');
template_polygon_feature([[[1928, 1382],[2043, 1382],[2043, 1292],[1928, 1292],[1928, 1382]]], 'лестница к спортзалу', 'gymstairs');

// лифты
template_polygon_feature([[[643, 1122],[730, 1122],[730, 1024],[643, 1024],[643, 1122]]], 'лифт', 'elevator1');
template_polygon_feature([[[645, 887],[735, 887],[735, 790],[645, 790],[645, 887]]], 'лифт', 'elevator2');
template_polygon_feature([[[2642, 1123],[2729, 1123],[2729, 1027],[2642, 1027],[2642, 1123]]], 'лифт', 'elevator3');
template_polygon_feature([[[2638, 889],[2727, 889],[2727, 792],[2638, 792],[2638, 889]]], 'лифт', 'elevator4');

// туалеты
template_polygon_feature([[[637, 1320],[801, 1320],[801, 1136],[637, 1136],[637, 1320]]], '208 (ремонт)', 'toilet1');
template_polygon_feature([[[2581, 1726],[2740, 1726],[2740, 1525],[2581, 1525],[2581, 1726]]], 'туалет мужской', 'toilet2');

// аудитории левого крыла
template_polygon_feature([[[178, 1320],[475, 1320],[475, 950],[178, 950],[178, 1320]]], '207 (кафедра философии культуры и культорологии, центр Артефакт)', '207');
template_polygon_feature([[[178, 947],[475, 947],[475, 832],[178, 832],[178, 947]]], '206 (совет студентов философского факультета)', '206');
template_polygon_feature([[[178, 828],[475, 828],[475, 602],[178, 602],[178, 828]]], '205 (кафедра теоретической и социальной философии, <br> учебно-научная лаборатория ЦИФРА)', '205');
template_polygon_feature([[[178, 600], [632, 600], [632, 373], [510, 373], [510, 250], [178, 250], [178, 600]]], '204 (деканат философского факультета)', '204');
template_polygon_feature([[[886, 1097],[1073, 1097],[1073, 778],[886, 778],[886, 1097]]], '209', '209');
template_polygon_feature([[[1076, 1097],[1244, 1097],[1244, 778],[1076, 778],[1076, 1097]]], '210', '210');
template_polygon_feature([[[1247, 1097],[1348, 1097],[1348, 778],[1247, 778],[1247, 1097]]], '211 (кафедра теологии и религиоведения)', '211');
template_polygon_feature([[[1351, 1097],[1458, 1097],[1458, 778],[1351, 778],[1351, 1097]]], '212 (заведующий кафедрой теологии и религиоведения)', '212');
template_polygon_feature([[[632, 631],[918, 631],[918, 373],[632, 373],[632, 631]]], '203 (лекционная аудитория им. А.Ф. Аскина)', '203');
template_polygon_feature([[[921, 631],[1163, 631],[1163, 373],[921, 373],[921, 631]]], '202 (лекционная аудитория им. С.Л. Франка)', '202');
template_polygon_feature([[[1166, 631],[1361, 631],[1361, 373],[1166, 373],[1166, 631]]], '201', '201');

// аудитории правого крыла
template_polygon_feature([[[1998, 635], [2230, 635], [2230, 373], [1998, 373], [1998, 635]]], '230 (лаборатория аудиовизуальных средств обучения, <br> компьютерный класс)', '230');
template_polygon_feature([[[2233, 635], [2504, 635], [2504, 373], [2233, 373], [2233, 635]]], '229 (лаборатория информационных <br> технологий 2, компьютерный класс)', '229');
template_polygon_feature([[[2507, 635],[2749, 635],[2749, 373],[2507, 373],[2507, 635]]], '228 (лаборатория информационных <br> технологий 1, компьютерный класс)', '228');
template_polygon_feature([[[1915, 1097], [2148, 1097], [2148, 778], [1915, 778], [1915, 1097]]], '215 (лаборатория информационных технологий 3, компьютерный класс)', '215');
template_polygon_feature([[[2151, 1097],[2300, 1097],[2300, 778],[2151, 778],[2151, 1097]]], '216 (лаборатория технической диагностики)', '216');
template_polygon_feature([[[2303, 1097],[2488, 1097],[2488, 778],[2303, 778],[2303, 1097]]], '217 (центр олимпиадной подготовки программистов <br> им. Н.Л. Андреевой, компьютерный класс)', '217');
template_polygon_feature([[[2894, 565],[3193, 565],[3193, 251],[2863, 251],[2863, 373],[2894, 373],[2894, 565]]], '227 (деканат <br> факультета ФМиЕНД (ПИ), <br> базовая кафедра <br> ГАОУ СО "ФТЛ лицей №1")', '227');
template_polygon_feature([[[2894, 568], [3193, 568], [3193, 929], [2894, 929], [2894, 568]]], '226 (базовые кафедры <br> Мирантис ИТ, филиала № 2 <br> ООО "РНТ")', '226');
template_polygon_feature([[[2894, 1318], [3193, 1318], [3193, 932], [2894, 932], [2894, 1318]]], '225 (кафедра системного <br> анализа и автоматического <br> управления)', '225');
template_polygon_feature([[[2894, 1550], [3310, 1550], [3310, 1320], [2894, 1320], [2894, 1550]]], '224 (лекционная аудитория)', '224');
template_polygon_feature([[[2894, 1628],[3193, 1628],[3193, 1552],[2894, 1552],[2894, 1628]]], '222', '222');
template_polygon_feature([[[2894, 1717],[3193, 1717],[3193, 1630],[2894, 1630],[2894, 1717]]], '221', '221');
template_polygon_feature([[[2894, 1948], [3315, 1948], [3315, 1719], [2894, 1719], [2894, 1948]]], '220 (лекционная аудитория)', '220');

const map = create_map('second_floor.svg');

const popup = create_popup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(2);