import {
  createMap,
  createPopup,
  pointermove,
  click,
  polygonFeatures,
  templatePolygonFeature,
  defaultStyle,
  highlightStyle,
  imageWidth,
  imageHeight,
  imageExtent,
  proj,
  vectorSource,
  show_schedule,
  vectorLayer,
  openModal,
  setupGlobalFilters,
} from '/index.js';

// лестницы
templatePolygonFeature(
  [
    [
      [1479, 1027],
      [1600, 1027],
      [1600, 944],
      [1479, 944],
      [1479, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs1',
);
templatePolygonFeature(
  [
    [
      [1604, 1001],
      [1769, 1001],
      [1769, 873],
      [1604, 873],
      [1604, 1001],
    ],
  ],
  'центральная лестница',
  'centralstairs2',
);
templatePolygonFeature(
  [
    [
      [1772, 1027],
      [1892, 1027],
      [1892, 944],
      [1772, 944],
      [1772, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs3',
);
templatePolygonFeature(
  [
    [
      [2494, 1088],
      [2637, 1088],
      [2637, 947],
      [2494, 947],
      [2494, 1088],
    ],
  ],
  'лестница',
  'rightstairs',
);
templatePolygonFeature(
  [
    [
      [2587, 1916],
      [2730, 1916],
      [2730, 1844],
      [2587, 1844],
      [2587, 1916],
    ],
  ],
  'лестница',
  'farrightstairs',
);
templatePolygonFeature(
  [
    [
      [737, 1079],
      [876, 1079],
      [876, 940],
      [737, 940],
      [737, 1079],
    ],
  ],
  'лестница',
  'leftstairs',
);
templatePolygonFeature(
  [
    [
      [133, 1548],
      [201, 1548],
      [201, 1468],
      [133, 1468],
      [133, 1548],
    ],
  ],
  'лестница',
  'farleftstairs1',
);
templatePolygonFeature(
  [
    [
      [62, 1466],
      [134, 1466],
      [134, 1395],
      [62, 1395],
      [62, 1466],
    ],
  ],
  'лестница',
  'farleftstairs2',
);
templatePolygonFeature(
  [
    [
      [131, 1396],
      [201, 1396],
      [201, 1320],
      [131, 1320],
      [131, 1396],
    ],
  ],
  'лестница',
  'farleftstairs3',
);
templatePolygonFeature(
  [
    [
      [1928, 1382],
      [2043, 1382],
      [2043, 1292],
      [1928, 1292],
      [1928, 1382],
    ],
  ],
  'лестница к спортзалу',
  'gymstairs',
);

// лифты
templatePolygonFeature(
  [
    [
      [643, 1122],
      [730, 1122],
      [730, 1024],
      [643, 1024],
      [643, 1122],
    ],
  ],
  'лифт',
  'elevator1',
);
templatePolygonFeature(
  [
    [
      [645, 887],
      [735, 887],
      [735, 790],
      [645, 790],
      [645, 887],
    ],
  ],
  'лифт',
  'elevator2',
);
templatePolygonFeature(
  [
    [
      [2642, 1123],
      [2729, 1123],
      [2729, 1027],
      [2642, 1027],
      [2642, 1123],
    ],
  ],
  'лифт',
  'elevator3',
);
templatePolygonFeature(
  [
    [
      [2638, 889],
      [2727, 889],
      [2727, 792],
      [2638, 792],
      [2638, 889],
    ],
  ],
  'лифт',
  'elevator4',
);

// туалеты
templatePolygonFeature(
  [
    [
      [637, 1320],
      [801, 1320],
      [801, 1136],
      [637, 1136],
      [637, 1320],
    ],
  ],
  'туалет мужской',
  'toilet1',
);
templatePolygonFeature(
  [
    [
      [2581, 1726],
      [2740, 1726],
      [2740, 1525],
      [2581, 1525],
      [2581, 1726],
    ],
  ],
  'туалет женский',
  'toilet2',
);

// аудитории левого крыла
templatePolygonFeature(
  [
    [
      [178, 1949],
      [686, 1949],
      [686, 1551],
      [178, 1551],
      [178, 1949],
    ],
  ],
  '310 (лекционная аудитория им. А. М. Богомолова)',
  '310',
);
templatePolygonFeature(
  [
    [
      [318, 1546],
      [492, 1546],
      [492, 1429],
      [318, 1429],
      [318, 1546],
    ],
  ],
  '309',
  '309',
);
templatePolygonFeature(
  [
    [
      [239, 1409],
      [306, 1409],
      [306, 1325],
      [239, 1325],
      [239, 1409],
    ],
  ],
  '300 (компьютерный класс, <br> находится между 3 и 4 этажами)',
  '300',
);
templatePolygonFeature(
  [
    [
      [178, 1320],
      [475, 1320],
      [475, 950],
      [178, 950],
      [178, 1320],
    ],
  ],
  '308 (кафедры информатики и программирования, математической <br> кибернетики и компьютерных наук)',
  '308',
);
templatePolygonFeature(
  [
    [
      [178, 947],
      [475, 947],
      [475, 830],
      [178, 830],
      [178, 947],
    ],
  ],
  '307 (заместитель по заочному отделению факультет КНиИТ)',
  '307',
);
templatePolygonFeature(
  [
    [
      [178, 828],
      [475, 828],
      [475, 602],
      [178, 602],
      [178, 828],
    ],
  ],
  '306 (кафедра дискретной математики и информационных технологий)',
  '306',
);
templatePolygonFeature(
  [
    [
      [178, 600],
      [632, 600],
      [632, 373],
      [510, 373],
      [510, 250],
      [178, 250],
      [178, 600],
    ],
  ],
  '305 (деканат факультета КНиИТ)',
  '305',
);
templatePolygonFeature(
  [
    [
      [886, 1097],
      [1073, 1097],
      [1073, 778],
      [886, 778],
      [886, 1097],
    ],
  ],
  '312',
  '312',
);
templatePolygonFeature(
  [
    [
      [1076, 1097],
      [1244, 1097],
      [1244, 778],
      [1076, 778],
      [1076, 1097],
    ],
  ],
  '313',
  '313',
);
templatePolygonFeature(
  [
    [
      [1247, 1097],
      [1458, 1097],
      [1458, 778],
      [1247, 778],
      [1247, 1097],
    ],
  ],
  '314 (лаборатория компьютерной безопасности)',
  '314',
);
templatePolygonFeature(
  [
    [
      [632, 631],
      [918, 631],
      [918, 373],
      [632, 373],
      [632, 631],
    ],
  ],
  '304 (лекционная аудитория)',
  '304',
);
templatePolygonFeature(
  [
    [
      [921, 631],
      [1163, 631],
      [1163, 373],
      [921, 373],
      [921, 631],
    ],
  ],
  '303 (лекционная аудитория)',
  '303',
);
templatePolygonFeature(
  [
    [
      [1166, 631],
      [1361, 631],
      [1361, 373],
      [1166, 373],
      [1166, 631],
    ],
  ],
  '302',
  '302',
);
templatePolygonFeature(
  [
    [
      [1364, 635],
      [1525, 635],
      [1525, 373],
      [1364, 373],
      [1364, 635],
    ],
  ],
  '301 (кафедра теоретических основ компьютерной <br> безопасности и криптографии)',
  '301',
);
templatePolygonFeature(
  [
    [
      [1528, 635],
      [1815, 635],
      [1815, 373],
      [1528, 373],
      [1528, 635],
    ],
  ],
  '333 (лекционная аудитория)',
  '333',
);

// аудитории правого крыла
templatePolygonFeature(
  [
    [
      [1818, 635],
      [1995, 635],
      [1995, 373],
      [1818, 373],
      [1818, 635],
    ],
  ],
  '331',
  '331',
);
templatePolygonFeature(
  [
    [
      [1998, 635],
      [2230, 635],
      [2230, 373],
      [1998, 373],
      [1998, 635],
    ],
  ],
  '330',
  '330',
);
templatePolygonFeature(
  [
    [
      [2233, 635],
      [2504, 635],
      [2504, 373],
      [2233, 373],
      [2233, 635],
    ],
  ],
  '329 (компьютерный класс)',
  '329',
);
templatePolygonFeature(
  [
    [
      [2507, 635],
      [2749, 635],
      [2749, 373],
      [2507, 373],
      [2507, 635],
    ],
  ],
  '328 (компьютерный класс)',
  '328',
);
templatePolygonFeature(
  [
    [
      [1915, 1097],
      [2163, 1097],
      [2163, 778],
      [1915, 778],
      [1915, 1097],
    ],
  ],
  '315 (лекционная аудитория)',
  '315',
);
templatePolygonFeature(
  [
    [
      [2166, 1097],
      [2300, 1097],
      [2300, 778],
      [2166, 778],
      [2166, 1097],
    ],
  ],
  '316 (учебная лаборатория прикладной психологии образования)',
  '316',
);
templatePolygonFeature(
  [
    [
      [2303, 1097],
      [2488, 1097],
      [2488, 778],
      [2303, 778],
      [2303, 1097],
    ],
  ],
  '317',
  '317',
);
templatePolygonFeature(
  [
    [
      [2894, 565],
      [3193, 565],
      [3193, 251],
      [2863, 251],
      [2863, 373],
      [2894, 373],
      [2894, 565],
    ],
  ],
  '327 (кафедры <br> коррекционной педагогики, <br> технологического <br> образования)',
  '327',
);
templatePolygonFeature(
  [
    [
      [2894, 568],
      [3193, 568],
      [3193, 929],
      [2894, 929],
      [2894, 568],
    ],
  ],
  '326 (кафедра социальной <br> психологии образования <br> и развития)',
  '326',
);
templatePolygonFeature(
  [
    [
      [2894, 1318],
      [3193, 1318],
      [3193, 932],
      [2894, 932],
      [2894, 1318],
    ],
  ],
  '325 (кафедры начального <br> языкового и литературного, <br> естественно-математтического <br> образований)',
  '325',
);
templatePolygonFeature(
  [
    [
      [2894, 1550],
      [3310, 1550],
      [3310, 1320],
      [2894, 1320],
      [2894, 1550],
    ],
  ],
  '323/324',
  '324',
);
templatePolygonFeature(
  [
    [
      [2894, 1628],
      [3193, 1628],
      [3193, 1552],
      [2894, 1552],
      [2894, 1628],
    ],
  ],
  '322',
  '322',
);
templatePolygonFeature(
  [
    [
      [2894, 1714],
      [3193, 1714],
      [3193, 1630],
      [2894, 1630],
      [2894, 1714],
    ],
  ],
  '321',
  '321',
);
templatePolygonFeature(
  [
    [
      [2894, 1948],
      [3315, 1948],
      [3315, 1719],
      [2894, 1719],
      [2894, 1948],
    ],
  ],
  '319/320',
  '320',
);

// специальные помещения
templatePolygonFeature(
  [
    [
      [1510, 1295],
      [1688, 1295],
      [1688, 1193],
      [1510, 1193],
      [1510, 1295],
    ],
  ],
  'преподавательская',
  'teacherroom1',
);
templatePolygonFeature(
  [
    [
      [1691, 1295],
      [1865, 1295],
      [1865, 1193],
      [1691, 1193],
      [1691, 1295],
    ],
  ],
  'преподавательская',
  'teacherroom2',
);
templatePolygonFeature(
  [
    [
      [1424, 1676],
      [1897, 1676],
      [1897, 1370],
      [1424, 1370],
      [1424, 1676],
    ],
  ],
  '1',
  'gym',
);

const map = createMap('third_floor.svg');

const popup = createPopup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(3);
