import {
  createMap,
  createPopup,
  pointermove,
  click,
  polygonFeatures,
  templatePolygonFeature,
  defaultStyle,
  highlightStyle,
  imageWidth,
  imageHeight,
  imageExtent,
  proj,
  vectorSource,
  show_schedule,
  vectorLayer,
  openModal,
  setupGlobalFilters,
} from '/index.js';

// лестницы
templatePolygonFeature(
  [
    [
      [1479, 1027],
      [1600, 1027],
      [1600, 944],
      [1479, 944],
      [1479, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs1',
);
templatePolygonFeature(
  [
    [
      [1604, 1001],
      [1769, 1001],
      [1769, 873],
      [1604, 873],
      [1604, 1001],
    ],
  ],
  'центральная лестница',
  'centralstairs2',
);
templatePolygonFeature(
  [
    [
      [1772, 1027],
      [1892, 1027],
      [1892, 944],
      [1772, 944],
      [1772, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs3',
);
templatePolygonFeature(
  [
    [
      [2494, 1088],
      [2637, 1088],
      [2637, 950],
      [2494, 950],
      [2494, 1088],
    ],
  ],
  'лестница',
  'rightstairs',
);
templatePolygonFeature(
  [
    [
      [2587, 1916],
      [2730, 1916],
      [2730, 1844],
      [2587, 1844],
      [2587, 1916],
    ],
  ],
  'лестница',
  'farrightstairs',
);
templatePolygonFeature(
  [
    [
      [737, 1079],
      [876, 1079],
      [876, 940],
      [737, 940],
      [737, 1079],
    ],
  ],
  'лестница',
  'leftstairs',
);
templatePolygonFeature(
  [
    [
      [133, 1548],
      [201, 1548],
      [201, 1468],
      [133, 1468],
      [133, 1548],
    ],
  ],
  'лестница',
  'farleftstairs1',
);
templatePolygonFeature(
  [
    [
      [62, 1466],
      [134, 1466],
      [134, 1398],
      [62, 1398],
      [62, 1466],
    ],
  ],
  'лестница',
  'farleftstairs2',
);
templatePolygonFeature(
  [
    [
      [131, 1396],
      [201, 1396],
      [201, 1320],
      [131, 1320],
      [131, 1396],
    ],
  ],
  'лестница',
  'farleftstairs3',
);

// лифты
templatePolygonFeature(
  [
    [
      [643, 1122],
      [730, 1122],
      [730, 1024],
      [643, 1024],
      [643, 1122],
    ],
  ],
  'лифт',
  'elevator1',
);
templatePolygonFeature(
  [
    [
      [645, 887],
      [735, 887],
      [735, 790],
      [645, 790],
      [645, 887],
    ],
  ],
  'лифт',
  'elevator2',
);
templatePolygonFeature(
  [
    [
      [2642, 1123],
      [2729, 1123],
      [2729, 1027],
      [2642, 1027],
      [2642, 1123],
    ],
  ],
  'лифт',
  'elevator3',
);
templatePolygonFeature(
  [
    [
      [2638, 889],
      [2727, 889],
      [2727, 792],
      [2638, 792],
      [2638, 889],
    ],
  ],
  'лифт',
  'elevator4',
);

// туалеты
templatePolygonFeature(
  [
    [
      [637, 1320],
      [801, 1320],
      [801, 1136],
      [637, 1136],
      [637, 1320],
    ],
  ],
  'туалет женский',
  'toilet1',
);
templatePolygonFeature(
  [
    [
      [2581, 1726],
      [2740, 1726],
      [2740, 1525],
      [2581, 1525],
      [2581, 1726],
    ],
  ],
  'туалет женский',
  'toilet2',
);

// аудитории левого крыла
templatePolygonFeature(
  [
    [
      [178, 1320],
      [475, 1320],
      [475, 1084],
      [178, 1084],
      [178, 1320],
    ],
  ],
  '508 (кафедры теории государства и права, социальных коммуникаций)',
  '508',
);
templatePolygonFeature(
  [
    [
      [178, 1081],
      [475, 1081],
      [475, 954],
      [178, 954],
      [178, 1081],
    ],
  ],
  '507 (совет студентов и аспирантов юридического факультета)',
  '507',
);
templatePolygonFeature(
  [
    [
      [178, 950],
      [475, 950],
      [475, 604],
      [178, 604],
      [178, 950],
    ],
  ],
  '506 (кафедра конституционного и муниципального права)',
  '506',
);
templatePolygonFeature(
  [
    [
      [178, 600],
      [632, 600],
      [632, 373],
      [510, 373],
      [510, 250],
      [178, 250],
      [178, 600],
    ],
  ],
  '505 (деканат юридического факультета)',
  '505',
);
templatePolygonFeature(
  [
    [
      [886, 1097],
      [1073, 1097],
      [1073, 778],
      [886, 778],
      [886, 1097],
    ],
  ],
  '510 (зал заседаний советов)',
  '510',
);
templatePolygonFeature(
  [
    [
      [1076, 1097],
      [1244, 1097],
      [1244, 778],
      [1076, 778],
      [1076, 1097],
    ],
  ],
  '511 (учебная лаборатория криминалистического исследования документов)',
  '511',
);
templatePolygonFeature(
  [
    [
      [1247, 1097],
      [1458, 1097],
      [1458, 778],
      [1247, 778],
      [1247, 1097],
    ],
  ],
  '512 (учебная лаборатория ЛИССА)',
  '512',
);
templatePolygonFeature(
  [
    [
      [632, 631],
      [918, 631],
      [918, 373],
      [632, 373],
      [632, 631],
    ],
  ],
  '504 (компьютерный класс юридического факультета)',
  '504',
);
templatePolygonFeature(
  [
    [
      [921, 631],
      [1163, 631],
      [1163, 373],
      [921, 373],
      [921, 631],
    ],
  ],
  '503 (компьютерный класс юридического факультета)',
  '503',
);
templatePolygonFeature(
  [
    [
      [1166, 631],
      [1361, 631],
      [1361, 373],
      [1166, 373],
      [1166, 631],
    ],
  ],
  '502',
  '502',
);
templatePolygonFeature(
  [
    [
      [1364, 635],
      [1518, 635],
      [1518, 373],
      [1364, 373],
      [1364, 635],
    ],
  ],
  '501',
  '501',
);
templatePolygonFeature(
  [
    [
      [1521, 635],
      [1824, 635],
      [1824, 373],
      [1521, 373],
      [1521, 635],
    ],
  ],
  '530/531',
  '530',
);

// аудитории правого крыла
templatePolygonFeature(
  [
    [
      [1827, 635],
      [1995, 635],
      [1995, 373],
      [1827, 373],
      [1827, 635],
    ],
  ],
  '529',
  '529',
);
templatePolygonFeature(
  [
    [
      [1998, 635],
      [2230, 635],
      [2230, 373],
      [1998, 373],
      [1998, 635],
    ],
  ],
  '528 (зал судебных заседаний)',
  '528',
);
templatePolygonFeature(
  [
    [
      [2233, 635],
      [2504, 635],
      [2504, 373],
      [2233, 373],
      [2233, 635],
    ],
  ],
  '527',
  '527',
);
templatePolygonFeature(
  [
    [
      [2507, 635],
      [2749, 635],
      [2749, 373],
      [2507, 373],
      [2507, 635],
    ],
  ],
  '526 (компьютерный класс юридического <br> факультета)',
  '526',
);
templatePolygonFeature(
  [
    [
      [1915, 1097],
      [2163, 1097],
      [2163, 778],
      [1915, 778],
      [1915, 1097],
    ],
  ],
  '513',
  '513',
);
templatePolygonFeature(
  [
    [
      [2166, 1097],
      [2300, 1097],
      [2300, 778],
      [2166, 778],
      [2166, 1097],
    ],
  ],
  '514',
  '514',
);
templatePolygonFeature(
  [
    [
      [2303, 1097],
      [2488, 1097],
      [2488, 778],
      [2303, 778],
      [2303, 1097],
    ],
  ],
  '515 (учебная лаборатория криминалистики и <br> судебных экспертиз)',
  '515',
);
templatePolygonFeature(
  [
    [
      [2894, 565],
      [3193, 565],
      [3193, 251],
      [2863, 251],
      [2863, 373],
      [2894, 373],
      [2894, 565],
    ],
  ],
  '525 (кафедры таможенного, <br> административного и <br> финансового права и <br> уголовного, экологического <br> права и криминологии)',
  '525',
);
templatePolygonFeature(
  [
    [
      [2894, 568],
      [3193, 568],
      [3193, 929],
      [2894, 929],
      [2894, 568],
    ],
  ],
  '524 (кафедра гражданского <br> права и процесса)',
  '524',
);
templatePolygonFeature(
  [
    [
      [2894, 1318],
      [3193, 1318],
      [3193, 932],
      [2894, 932],
      [2894, 1318],
    ],
  ],
  '523 (кафедра политических <br> наук)',
  '523',
);
templatePolygonFeature(
  [
    [
      [2894, 1550],
      [3310, 1550],
      [3310, 1320],
      [2894, 1320],
      [2894, 1550],
    ],
  ],
  '521/522',
  '521',
);
templatePolygonFeature(
  [
    [
      [2894, 1628],
      [3193, 1628],
      [3193, 1552],
      [2894, 1552],
      [2894, 1628],
    ],
  ],
  '520',
  '520',
);
templatePolygonFeature(
  [
    [
      [2894, 1717],
      [3193, 1717],
      [3193, 1630],
      [2894, 1630],
      [2894, 1717],
    ],
  ],
  '519',
  '519',
);
templatePolygonFeature(
  [
    [
      [2894, 1832],
      [3315, 1832],
      [3315, 1719],
      [2894, 1719],
      [2894, 1832],
    ],
  ],
  '518',
  '518',
);
templatePolygonFeature(
  [
    [
      [2894, 1948],
      [3315, 1948],
      [3315, 1832],
      [2894, 1832],
      [2894, 1948],
    ],
  ],
  '517',
  '517',
);

const map = createMap('fifth_floor.svg');

const popup = createPopup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(5);
