import {
  createMap,
  createPopup,
  pointermove,
  click,
  polygonFeatures,
  templatePolygonFeature,
  defaultStyle,
  highlightStyle,
  imageWidth,
  imageHeight,
  imageExtent,
  proj,
  vectorSource,
  show_schedule,
  vectorLayer,
  openModal,
  setupGlobalFilters,
} from '/index.js';

// лестницы
templatePolygonFeature(
  [
    [
      [1479, 1027],
      [1600, 1027],
      [1600, 944],
      [1479, 944],
      [1479, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs1',
);
templatePolygonFeature(
  [
    [
      [1604, 1001],
      [1769, 1001],
      [1769, 873],
      [1604, 873],
      [1604, 1001],
    ],
  ],
  'центральная лестница',
  'centralstairs2',
);
templatePolygonFeature(
  [
    [
      [1772, 1027],
      [1892, 1027],
      [1892, 944],
      [1772, 944],
      [1772, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs3',
);
templatePolygonFeature(
  [
    [
      [2494, 1088],
      [2637, 1088],
      [2637, 950],
      [2494, 950],
      [2494, 1088],
    ],
  ],
  'лестница',
  'rightstairs',
);
templatePolygonFeature(
  [
    [
      [2587, 1916],
      [2730, 1916],
      [2730, 1844],
      [2587, 1844],
      [2587, 1916],
    ],
  ],
  'лестница',
  'farrightstairs',
);
templatePolygonFeature(
  [
    [
      [737, 1079],
      [876, 1079],
      [876, 940],
      [737, 940],
      [737, 1079],
    ],
  ],
  'лестница',
  'leftstairs',
);
templatePolygonFeature(
  [
    [
      [133, 1548],
      [201, 1548],
      [201, 1468],
      [133, 1468],
      [133, 1548],
    ],
  ],
  'лестница',
  'farleftstairs1',
);
templatePolygonFeature(
  [
    [
      [62, 1466],
      [132, 1466],
      [132, 1398],
      [62, 1398],
      [62, 1466],
    ],
  ],
  'лестница',
  'farleftstairs2',
);
templatePolygonFeature(
  [
    [
      [131, 1396],
      [201, 1396],
      [201, 1320],
      [131, 1320],
      [131, 1396],
    ],
  ],
  'лестница',
  'farleftstairs3',
);

// лифты
templatePolygonFeature(
  [
    [
      [643, 1122],
      [730, 1122],
      [730, 1024],
      [643, 1024],
      [643, 1122],
    ],
  ],
  'лифт',
  'elevator1',
);
templatePolygonFeature(
  [
    [
      [645, 887],
      [735, 887],
      [735, 790],
      [645, 790],
      [645, 887],
    ],
  ],
  'лифт',
  'elevator2',
);
templatePolygonFeature(
  [
    [
      [2642, 1123],
      [2729, 1123],
      [2729, 1027],
      [2642, 1027],
      [2642, 1123],
    ],
  ],
  'лифт',
  'elevator3',
);
templatePolygonFeature(
  [
    [
      [2638, 889],
      [2727, 889],
      [2727, 792],
      [2638, 792],
      [2638, 889],
    ],
  ],
  'лифт',
  'elevator4',
);

// туалеты
templatePolygonFeature(
  [
    [
      [637, 1320],
      [801, 1320],
      [801, 1136],
      [637, 1136],
      [637, 1320],
    ],
  ],
  '611',
  'toilet1',
);
templatePolygonFeature(
  [
    [
      [2575, 1639],
      [2740, 1639],
      [2740, 1525],
      [2575, 1525],
      [2575, 1639],
    ],
  ],
  'туалет для сотрудников',
  'toilet2',
);
templatePolygonFeature(
  [
    [
      [2581, 1726],
      [2581, 1639],
      [2740, 1639],
      [2740, 1726],
      [2581, 1726],
    ],
  ],
  '621',
  'toiletgym',
);

// аудитории левого крыла
templatePolygonFeature(
  [
    [
      [178, 1949],
      [686, 1949],
      [686, 1551],
      [178, 1551],
      [178, 1949],
    ],
  ],
  '610 (вход через 5 этаж)',
  '610',
);
templatePolygonFeature(
  [
    [
      [314, 1546],
      [507, 1546],
      [507, 1438],
      [314, 1438],
      [314, 1546],
    ],
  ],
  '609 (учебная лаборатория судебной фотографии и судебной видеозаписи)',
  '609',
);
templatePolygonFeature(
  [
    [
      [177, 1317],
      [474, 1317],
      [474, 1121],
      [177, 1121],
      [177, 1317],
    ],
  ],
  '608 (учебная аудитория)',
  '608',
);
templatePolygonFeature(
  [
    [
      [177, 1118],
      [474, 1118],
      [474, 955],
      [177, 955],
      [177, 1118],
    ],
  ],
  '607 (учебный и научный раздел ИДПО)',
  '607',
);
templatePolygonFeature(
  [
    [
      [178, 602],
      [475, 602],
      [475, 950],
      [178, 950],
      [178, 602],
    ],
  ],
  '606',
  '606',
);
templatePolygonFeature(
  [
    [
      [178, 600],
      [632, 600],
      [632, 373],
      [510, 373],
      [510, 250],
      [178, 250],
      [178, 600],
    ],
  ],
  '605 (директор ИДПО)',
  '605',
);
templatePolygonFeature(
  [
    [
      [886, 1097],
      [1071, 1097],
      [1071, 778],
      [886, 778],
      [886, 1097],
    ],
  ],
  '612 (центр профессионального развития и бизнес-стратегий)',
  '612',
);
templatePolygonFeature(
  [
    [
      [1075, 1097],
      [1292, 1097],
      [1292, 778],
      [1075, 778],
      [1075, 1097],
    ],
  ],
  '613 (учебная аудитория)',
  '613',
);
templatePolygonFeature(
  [
    [
      [1295, 1097],
      [1458, 1097],
      [1458, 778],
      [1295, 778],
      [1295, 1097],
    ],
  ],
  '614 (учебная лаборатория)',
  '614',
);
templatePolygonFeature(
  [
    [
      [632, 631],
      [918, 631],
      [918, 373],
      [632, 373],
      [632, 631],
    ],
  ],
  '604 (компьютерный класс)',
  '604',
);
templatePolygonFeature(
  [
    [
      [921, 631],
      [1163, 631],
      [1163, 373],
      [921, 373],
      [921, 631],
    ],
  ],
  '603 (учебная аудитория)',
  '603',
);
templatePolygonFeature(
  [
    [
      [1166, 631],
      [1361, 631],
      [1361, 373],
      [1166, 373],
      [1166, 631],
    ],
  ],
  '602 (кафедра педагогики и психологии профессионального образования, <br> центр профессиональной переподготовки)',
  '602',
);
templatePolygonFeature(
  [
    [
      [1364, 635],
      [1564, 635],
      [1564, 373],
      [1364, 373],
      [1364, 635],
    ],
  ],
  '601 (кафедра менеджмента в образовании, <br> центр повышения квалификации)',
  '601',
);
templatePolygonFeature(
  [
    [
      [1567, 635],
      [1899, 635],
      [1899, 373],
      [1567, 373],
      [1567, 635],
    ],
  ],
  '639 (учебная аудитория)',
  '639',
);

// аудитории правого крыла
templatePolygonFeature(
  [
    [
      [1901, 635],
      [2051, 635],
      [2051, 373],
      [1901, 373],
      [1901, 635],
    ],
  ],
  '637 (диссертационный совет по педагогическим наукам)',
  '637',
);
templatePolygonFeature(
  [
    [
      [2055, 635],
      [2160, 635],
      [2160, 373],
      [2055, 373],
      [2055, 635],
    ],
  ],
  '636 (кафедра методологии образования)',
  '636',
);
templatePolygonFeature(
  [
    [
      [2163, 635],
      [2267, 635],
      [2267, 373],
      [2163, 373],
      [2163, 635],
    ],
  ],
  '635 (кафедра логопедии и психолингвистики)',
  '635',
);
templatePolygonFeature(
  [
    [
      [2270, 635],
      [2400, 635],
      [2400, 373],
      [2270, 373],
      [2270, 635],
    ],
  ],
  '634',
  '634',
);
templatePolygonFeature(
  [
    [
      [2403, 635],
      [2751, 635],
      [2751, 373],
      [2403, 373],
      [2403, 635],
    ],
  ],
  '633 (дирекция педагогического института)',
  '633',
);
templatePolygonFeature(
  [
    [
      [1914, 1098],
      [1991, 1098],
      [1991, 777],
      [1914, 777],
      [1914, 1098],
    ],
  ],
  '615 (кабинет английского языка)',
  '615',
);
templatePolygonFeature(
  [
    [
      [1994, 1098],
      [2152, 1098],
      [2152, 777],
      [1994, 777],
      [1994, 1098],
    ],
  ],
  '616 (кафедра английского языка для гуманитарных <br> направлений и специальностей)',
  '616',
);
templatePolygonFeature(
  [
    [
      [2156, 927],
      [2271, 927],
      [2271, 777],
      [2156, 777],
      [2156, 927],
    ],
  ],
  '617 (архив факультета физической культуры и спорта)',
  '617',
);
templatePolygonFeature(
  [
    [
      [2159, 1098],
      [2355, 1098],
      [2355, 777],
      [2274, 777],
      [2274, 927],
      [2152, 927],
      [2159, 1098],
    ],
  ],
  '618 (деканат факультета физической культуры и спорта)',
  '618',
);
templatePolygonFeature(
  [
    [
      [2358, 1098],
      [2485, 1098],
      [2485, 777],
      [2358, 777],
      [2358, 1098],
    ],
  ],
  '619 (декан факультета физической культуры и спорта)',
  '619',
);
templatePolygonFeature(
  [
    [
      [2894, 565],
      [3193, 565],
      [3193, 251],
      [2863, 251],
      [2863, 373],
      [2894, 373],
      [2894, 565],
    ],
  ],
  '632 (профсоюзный комитет <br> работников СГУ)',
  '632',
);
templatePolygonFeature(
  [
    [
      [2894, 568],
      [3193, 568],
      [3193, 824],
      [2894, 824],
      [2894, 568],
    ],
  ],
  '631 (аудитория им. <br> К.Ф. Седова)',
  '631',
);
templatePolygonFeature(
  [
    [
      [2894, 932],
      [3193, 932],
      [3193, 827],
      [2894, 827],
      [2894, 932],
    ],
  ],
  '630 (заместитель по <br> социально-воспитательной <br> работе факультета ППиСО и <br> профбюро ППиСО)',
  '630',
);
templatePolygonFeature(
  [
    [
      [2894, 1223],
      [3193, 1223],
      [3193, 934],
      [2894, 934],
      [2894, 1223],
    ],
  ],
  '629 (деканат ППиСО)',
  '629',
);
templatePolygonFeature(
  [
    [
      [2894, 1320],
      [3193, 1320],
      [3193, 1227],
      [2894, 1227],
      [2894, 1320],
    ],
  ],
  '628 (заместитель по <br> учебной работе ППиСО)',
  '628',
);
templatePolygonFeature(
  [
    [
      [2894, 1440],
      [3310, 1440],
      [3310, 1324],
      [2894, 1324],
      [2894, 1440],
    ],
  ],
  '627 (архив ППиСО)',
  '627',
);
templatePolygonFeature(
  [
    [
      [2894, 1552],
      [3310, 1552],
      [3310, 1444],
      [2894, 1444],
      [2894, 1552],
    ],
  ],
  '626 (деканат ППиСО <br> учебная часть)',
  '626',
);
templatePolygonFeature(
  [
    [
      [2894, 1628],
      [3193, 1628],
      [3193, 1552],
      [2894, 1552],
      [2894, 1628],
    ],
  ],
  '625 (председатель <br> профкома студентов)',
  '625',
);
templatePolygonFeature(
  [
    [
      [2894, 1717],
      [3193, 1717],
      [3193, 1637],
      [2894, 1637],
      [2894, 1717],
    ],
  ],
  '624 (профком студентов)',
  '624',
);
templatePolygonFeature(
  [
    [
      [2894, 1832],
      [3087, 1832],
      [3087, 1948],
      [3315, 1948],
      [3315, 1724],
      [2894, 1724],
      [2894, 1832],
    ],
  ],
  '623 (отдел по техническому <br> учёту объектов <br> недвижимости)',
  '623',
);
templatePolygonFeature(
  [
    [
      [2894, 1948],
      [3084, 1948],
      [3084, 1834],
      [2894, 1834],
      [2894, 1948],
    ],
  ],
  '622',
  '622',
);

const map = createMap('sixth_floor.svg');

const popup = createPopup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(6);
