import {
  createMap,
  createPopup,
  pointermove,
  click,
  polygonFeatures,
  templatePolygonFeature,
  defaultStyle,
  highlightStyle,
  imageWidth,
  imageHeight,
  imageExtent,
  proj,
  vectorSource,
  show_schedule,
  vectorLayer,
  openModal,
  setupGlobalFilters,
} from '/index.js';

// лестницы
templatePolygonFeature(
  [
    [
      [1500, 1085],
      [1626, 1085],
      [1626, 1004],
      [1500, 1004],
      [1500, 1085],
    ],
  ],
  'центральная лестница',
  'centralstairs1',
);
templatePolygonFeature(
  [
    [
      [1628, 1002],
      [1743, 1002],
      [1743, 873],
      [1628, 873],
      [1628, 1002],
    ],
  ],
  'центральная лестница',
  'centralstairs2',
);
templatePolygonFeature(
  [
    [
      [1743, 1085],
      [1869, 1085],
      [1869, 1002],
      [1743, 1002],
      [1743, 1085],
    ],
  ],
  'центральная лестница',
  'centralstairs3',
);
templatePolygonFeature(
  [
    [
      [2494, 1063],
      [2637, 1063],
      [2637, 994],
      [2494, 994],
      [2494, 1063],
    ],
  ],
  'лестница',
  'rightstairs',
);
templatePolygonFeature(
  [
    [
      [2587, 1916],
      [2730, 1916],
      [2730, 1844],
      [2587, 1844],
      [2587, 1916],
    ],
  ],
  'лестница',
  'farrightstairs',
);
templatePolygonFeature(
  [
    [
      [737, 1060],
      [876, 1060],
      [876, 992],
      [737, 992],
      [737, 1060],
    ],
  ],
  'лестница',
  'leftstairs',
);
templatePolygonFeature(
  [
    [
      [133, 1548],
      [201, 1548],
      [201, 1468],
      [133, 1468],
      [133, 1548],
    ],
  ],
  'лестница',
  'farleftstairs1',
);
templatePolygonFeature(
  [
    [
      [62, 1466],
      [134, 1466],
      [134, 1398],
      [62, 1398],
      [62, 1466],
    ],
  ],
  'лестница',
  'farleftstairs2',
);
templatePolygonFeature(
  [
    [
      [131, 1396],
      [201, 1396],
      [201, 1320],
      [131, 1320],
      [131, 1396],
    ],
  ],
  'лестница',
  'farleftstairs3',
);
templatePolygonFeature(
  [
    [
      [1928, 1382],
      [2043, 1382],
      [2043, 1292],
      [1928, 1292],
      [1928, 1382],
    ],
  ],
  'лестница к спортзалу',
  'gymstairs',
);
templatePolygonFeature(
  [
    [
      [549, 496],
      [620, 496],
      [620, 221],
      [549, 221],
      [549, 496],
    ],
  ],
  'лестница к гардеробу',
  'closetstairs1',
);
templatePolygonFeature(
  [
    [
      [2760, 499],
      [2831, 499],
      [2831, 223],
      [2760, 223],
      [2760, 499],
    ],
  ],
  'лестница к гардеробу',
  'closetstairs2',
);
templatePolygonFeature(
  [
    [
      [343, 1070],
      [382, 1070],
      [382, 931],
      [343, 931],
      [343, 1070],
    ],
  ],
  'лестница',
  'emergencyexitstairs',
);
templatePolygonFeature(
  [
    [
      [1481, 104],
      [1887, 104],
      [1887, 4],
      [1481, 4],
      [1481, 104],
    ],
  ],
  'лестница ко входу в корпус',
  'entrancestairs',
);
templatePolygonFeature(
  [
    [
      [1457, 617],
      [1914, 617],
      [1914, 578],
      [1457, 578],
      [1457, 617],
    ],
  ],
  'лестница',
  'precentralstairs1',
);
templatePolygonFeature(
  [
    [
      [1464, 799],
      [1907, 799],
      [1907, 739],
      [1464, 739],
      [1464, 799],
    ],
  ],
  'лестница',
  'precentralstairs2',
);
templatePolygonFeature(
  [
    [
      [1458, 1397],
      [1595, 1397],
      [1595, 1352],
      [1458, 1352],
      [1458, 1397],
    ],
  ],
  'лестница к актовому залу',
  'assemblyhallstairs1',
);
templatePolygonFeature(
  [
    [
      [1780, 1397],
      [1915, 1397],
      [1915, 1350],
      [1780, 1350],
      [1780, 1397],
    ],
  ],
  'лестница к актовому залу',
  'assemblyhallstairs2',
);

// лифты
templatePolygonFeature(
  [
    [
      [643, 1122],
      [730, 1122],
      [730, 1024],
      [643, 1024],
      [643, 1122],
    ],
  ],
  'лифт',
  'elevator1',
);
templatePolygonFeature(
  [
    [
      [645, 887],
      [735, 887],
      [735, 790],
      [645, 790],
      [645, 887],
    ],
  ],
  'лифт',
  'elevator2',
);
templatePolygonFeature(
  [
    [
      [2642, 1123],
      [2729, 1123],
      [2729, 1027],
      [2642, 1027],
      [2642, 1123],
    ],
  ],
  'лифт',
  'elevator3',
);
templatePolygonFeature(
  [
    [
      [2638, 889],
      [2727, 889],
      [2727, 792],
      [2638, 792],
      [2638, 889],
    ],
  ],
  'лифт',
  'elevator4',
);

// туалеты
templatePolygonFeature(
  [
    [
      [637, 1320],
      [801, 1320],
      [801, 1136],
      [637, 1136],
      [637, 1320],
    ],
  ],
  'туалет мужской',
  'toilet1',
);
templatePolygonFeature(
  [
    [
      [2581, 1726],
      [2740, 1726],
      [2740, 1525],
      [2581, 1525],
      [2581, 1726],
    ],
  ],
  'туалет женский',
  'toilet2',
);

// аудитории левого крыла
templatePolygonFeature(
  [
    [
      [178, 1949],
      [686, 1949],
      [686, 1551],
      [178, 1551],
      [178, 1949],
    ],
  ],
  '110 (лекционная аудитория им. Р. Х. Тугушева)',
  '110',
);
templatePolygonFeature(
  [
    [
      [318, 1546],
      [505, 1546],
      [505, 1419],
      [318, 1419],
      [318, 1546],
    ],
  ],
  '109 (полиграфическая лаборатория)',
  '109',
);
templatePolygonFeature(
  [
    [
      [183, 1316],
      [478, 1316],
      [478, 1194],
      [183, 1194],
      [183, 1316],
    ],
  ],
  '108 (кафедра психологии личности)',
  '108',
);
templatePolygonFeature(
  [
    [
      [183, 1190],
      [478, 1190],
      [478, 1073],
      [183, 1073],
      [183, 1190],
    ],
  ],
  '107 (кафедра социальной психологии)',
  '107',
);

templatePolygonFeature(
  [
    [
      [180, 931],
      [478, 931],
      [478, 630],
      [180, 630],
      [180, 931],
    ],
  ],
  '105/106 (деканат факультета психологии)',
  '105',
);
templatePolygonFeature(
  [
    [
      [180, 627],
      [478, 627],
      [478, 374],
      [511, 374],
      [511, 249],
      [180, 249],
      [180, 627],
    ],
  ],
  '104 (деканат факультета психологии, заместители декана, секретарь)',
  '104',
);
templatePolygonFeature(
  [
    [
      [886, 1097],
      [1062, 1097],
      [1062, 778],
      [886, 778],
      [886, 1097],
    ],
  ],
  '112 (совет студентов факультета психологии)',
  '112',
);
templatePolygonFeature(
  [
    [
      [1067, 1097],
      [1241, 1097],
      [1241, 778],
      [1067, 778],
      [1067, 1097],
    ],
  ],
  '113 (аудитория им. А.А. Понукалина, тренинг-зал)',
  '113',
);
templatePolygonFeature(
  [
    [
      [1245, 1097],
      [1458, 1097],
      [1458, 778],
      [1245, 778],
      [1245, 1097],
    ],
  ],
  '114 (кафедра философии и методологии науки)',
  '114',
);
templatePolygonFeature(
  [
    [
      [632, 631],
      [882, 631],
      [882, 373],
      [632, 373],
      [632, 631],
    ],
  ],
  '103 (лекционная аудитория им. Л.П. Доблаева, <br> комната истории психологии)',
  '103',
);
templatePolygonFeature(
  [
    [
      [885, 631],
      [1135, 631],
      [1135, 373],
      [885, 373],
      [885, 631],
    ],
  ],
  '102 (лекционная аудитория им. А.А. Крогиуса)',
  '102',
);
templatePolygonFeature(
  [
    [
      [1139, 631],
      [1353, 631],
      [1353, 373],
      [1139, 373],
      [1139, 631],
    ],
  ],
  '101',
  '101',
);

// аудитории правого крыла
templatePolygonFeature(
  [
    [
      [2022, 635],
      [2243, 635],
      [2243, 373],
      [2022, 373],
      [2022, 635],
    ],
  ],
  '135 (кафедра общей и консультативной психологии)',
  '135',
);
templatePolygonFeature(
  [
    [
      [2246, 635],
      [2495, 635],
      [2495, 373],
      [2246, 373],
      [2246, 635],
    ],
  ],
  '134 (аудитория им. С.Л. Франка, компьютерный класс)',
  '134',
);
templatePolygonFeature(
  [
    [
      [2498, 635],
      [2749, 635],
      [2749, 373],
      [2498, 373],
      [2498, 635],
    ],
  ],
  '133 (аудитория им. Л.Г. Вяткина, компьютерный класс)',
  '133',
);
templatePolygonFeature(
  [
    [
      [2897, 1321],
      [3193, 1321],
      [3193, 1003],
      [2897, 1003],
      [2897, 1321],
    ],
  ],
  '127 (кафедра уголовного <br> процесса и судебных <br> экспертиз)',
  '127',
);
templatePolygonFeature(
  [
    [
      [2859, 374],
      [3193, 374],
      [3193, 253],
      [2859, 253],
      [2859, 374],
    ],
  ],
  '132 (кафедра педагогики <br> и образовательных <br> технологий)',
  '132',
);
templatePolygonFeature(
  [
    [
      [2897, 630],
      [3193, 630],
      [3193, 379],
      [2897, 379],
      [2897, 630],
    ],
  ],
  '131 (юридическая <br> клиника)',
  '131',
);
templatePolygonFeature(
  [
    [
      [2897, 771],
      [3193, 771],
      [3193, 635],
      [2897, 635],
      [2897, 771],
    ],
  ],
  '130',
  '130',
);
templatePolygonFeature(
  [
    [
      [2897, 886],
      [3193, 886],
      [3193, 774],
      [2897, 774],
      [2897, 886],
    ],
  ],
  '129',
  '129',
);
templatePolygonFeature(
  [
    [
      [2897, 998],
      [3193, 998],
      [3193, 890],
      [2897, 890],
      [2897, 998],
    ],
  ],
  '128 (комната матери <br> и ребёнка)',
  '128',
);

templatePolygonFeature(
  [
    [
      [2894, 1550],
      [3310, 1550],
      [3310, 1324],
      [2894, 1324],
      [2894, 1550],
    ],
  ],
  '126 (кафедра английского <br> языка и мекультурной <br> коммуникации)',
  '126',
  [
    {
      day: 'Среда',
      number: '2',
      department: ['КНиИТ'],
      group: ['131', '132', '111', '151'],
      teacher: 'Карпец Е.В.',
      lesson: 'Английский язык (переводчики) 5 гр.',
      type: 'лек.',
      parity: '-',
    },
  ],
);

templatePolygonFeature(
  [
    [
      [2894, 1717],
      [3193, 1717],
      [3193, 1552],
      [2894, 1552],
      [2894, 1717],
    ],
  ],
  '125 (вход через 126)',
  '125',
);
templatePolygonFeature(
  [
    [
      [2740, 1948],
      [3315, 1948],
      [3315, 1719],
      [2894, 1719],
      [2894, 1795],
      [2740, 1795],
      [2740, 1948],
    ],
  ],
  '123/124 (лекционная аудитория)',
  '123',
);

// аудитории в служебном коридоре
templatePolygonFeature(
  [
    [
      [1916, 1095],
      [2067, 1095],
      [2067, 883],
      [1916, 883],
      [1916, 1095],
    ],
  ],
  '115 (компьютерный класс)',
  '115',
);
templatePolygonFeature(
  [
    [
      [2070, 1095],
      [2170, 1095],
      [2170, 883],
      [2070, 883],
      [2070, 1095],
    ],
  ],
  '116',
  '116',
);
templatePolygonFeature(
  [
    [
      [2173, 1095],
      [2270, 1095],
      [2270, 883],
      [2173, 883],
      [2173, 1095],
    ],
  ],
  '117',
  '117',
);
templatePolygonFeature(
  [
    [
      [2273, 1095],
      [2347, 1095],
      [2347, 883],
      [2273, 883],
      [2273, 1095],
    ],
  ],
  '118',
  '118',
);
templatePolygonFeature(
  [
    [
      [2350, 1095],
      [2415, 1095],
      [2415, 883],
      [2350, 883],
      [2350, 1095],
    ],
  ],
  '119',
  '119',
);
templatePolygonFeature(
  [
    [
      [2418, 1095],
      [2488, 1095],
      [2488, 883],
      [2418, 883],
      [2418, 1095],
    ],
  ],
  '120',
  '120',
);
templatePolygonFeature(
  [
    [
      [1916, 880],
      [2488, 880],
      [2488, 779],
      [1916, 779],
      [1916, 880],
    ],
  ],
  'служебный коридор',
  'hallway',
);

// специальные помещения
templatePolygonFeature(
  [
    [
      [1356, 569],
      [1455, 569],
      [1455, 373],
      [1356, 373],
      [1356, 569],
    ],
  ],
  'охрана (тут можно попросить ключи)',
  'secutity',
);
templatePolygonFeature(
  [
    [
      [1598, 1396],
      [1777, 1396],
      [1777, 1294],
      [1598, 1294],
      [1598, 1396],
    ],
  ],
  'буфет (закрыт)',
  'cafeteria',
);
templatePolygonFeature(
  [
    [
      [1458, 1350],
      [1595, 1350],
      [1595, 1293],
      [1780, 1293],
      [1780, 1348],
      [1915, 1348],
      [1915, 1096],
      [1458, 1096],
      [1458, 1350],
    ],
  ],
  '"точка кипения"',
  'cafeteriahall',
);
templatePolygonFeature(
  [
    [
      [633, 368],
      [1455, 368],
      [1455, 208],
      [633, 208],
      [633, 368],
    ],
  ],
  'гардероб',
  'closet1',
);
templatePolygonFeature(
  [
    [
      [1917, 372],
      [2740, 372],
      [2740, 210],
      [1917, 210],
      [1917, 372],
    ],
  ],
  'гардероб (не работает)',
  'closet2',
);
templatePolygonFeature(
  [
    [
      [1218, 1959],
      [2161, 1959],
      [2161, 1399],
      [1218, 1399],
      [1218, 1959],
    ],
  ],
  'актовый зал',
  'assemblyhall',
);

const map = createMap('first_floor.svg');

const popup = createPopup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(1);
