import {
  createMap,
  createPopup,
  pointermove,
  click,
  polygonFeatures,
  templatePolygonFeature,
  defaultStyle,
  highlightStyle,
  imageWidth,
  imageHeight,
  imageExtent,
  proj,
  vectorSource,
  show_schedule,
  vectorLayer,
  openModal,
  setupGlobalFilters,
} from '/index.js';

// лестницы
templatePolygonFeature(
  [
    [
      [1479, 1027],
      [1600, 1027],
      [1600, 944],
      [1479, 944],
      [1479, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs1',
);
templatePolygonFeature(
  [
    [
      [1604, 1001],
      [1769, 1001],
      [1769, 873],
      [1604, 873],
      [1604, 1001],
    ],
  ],
  'центральная лестница',
  'centralstairs2',
);
templatePolygonFeature(
  [
    [
      [1772, 1027],
      [1892, 1027],
      [1892, 944],
      [1772, 944],
      [1772, 1027],
    ],
  ],
  'центральная лестница',
  'centralstairs3',
);
templatePolygonFeature(
  [
    [
      [2494, 1088],
      [2637, 1088],
      [2637, 950],
      [2494, 950],
      [2494, 1088],
    ],
  ],
  'лестница',
  'rightstairs',
);
templatePolygonFeature(
  [
    [
      [2587, 1916],
      [2730, 1916],
      [2730, 1844],
      [2587, 1844],
      [2587, 1916],
    ],
  ],
  'лестница',
  'farrightstairs',
);
templatePolygonFeature(
  [
    [
      [737, 1079],
      [876, 1079],
      [876, 940],
      [737, 940],
      [737, 1079],
    ],
  ],
  'лестница',
  'leftstairs',
);
templatePolygonFeature(
  [
    [
      [133, 1548],
      [201, 1548],
      [201, 1468],
      [133, 1468],
      [133, 1548],
    ],
  ],
  'лестница',
  'farleftstairs1',
);
templatePolygonFeature(
  [
    [
      [62, 1466],
      [134, 1466],
      [134, 1398],
      [62, 1398],
      [62, 1466],
    ],
  ],
  'лестница',
  'farleftstairs2',
);
templatePolygonFeature(
  [
    [
      [131, 1396],
      [201, 1396],
      [201, 1320],
      [131, 1320],
      [131, 1396],
    ],
  ],
  'лестница',
  'farleftstairs3',
);
templatePolygonFeature(
  [
    [
      [1928, 1382],
      [2043, 1382],
      [2043, 1292],
      [1928, 1292],
      [1928, 1382],
    ],
  ],
  'лестница к спортзалу',
  'gymstairs',
);

// лифты
templatePolygonFeature(
  [
    [
      [643, 1122],
      [730, 1122],
      [730, 1024],
      [643, 1024],
      [643, 1122],
    ],
  ],
  'лифт',
  'elevator1',
);
templatePolygonFeature(
  [
    [
      [645, 887],
      [735, 887],
      [735, 790],
      [645, 790],
      [645, 887],
    ],
  ],
  'лифт',
  'elevator2',
);
templatePolygonFeature(
  [
    [
      [2642, 1123],
      [2729, 1123],
      [2729, 1027],
      [2642, 1027],
      [2642, 1123],
    ],
  ],
  'лифт',
  'elevator3',
);
templatePolygonFeature(
  [
    [
      [2638, 889],
      [2727, 889],
      [2727, 792],
      [2638, 792],
      [2638, 889],
    ],
  ],
  'лифт',
  'elevator4',
);

// туалеты
templatePolygonFeature(
  [
    [
      [637, 1320],
      [801, 1320],
      [801, 1136],
      [637, 1136],
      [637, 1320],
    ],
  ],
  'туалет мужской',
  'toilet1',
);
templatePolygonFeature(
  [
    [
      [2581, 1726],
      [2740, 1726],
      [2740, 1525],
      [2581, 1525],
      [2581, 1726],
    ],
  ],
  'туалет мужской',
  'toilet2',
);
templatePolygonFeature(
  [
    [
      [1823, 1426],
      [1899, 1426],
      [1899, 1374],
      [1823, 1374],
      [1823, 1426],
    ],
  ],
  'туалет у раздевалки',
  'toiletgym',
);

// аудитории левого крыла
templatePolygonFeature(
  [
    [
      [178, 1949],
      [686, 1949],
      [686, 1551],
      [178, 1551],
      [178, 1949],
    ],
  ],
  '411 (конференц-зал экономического факультета)',
  '411',
);
templatePolygonFeature(
  [
    [
      [318, 1546],
      [492, 1546],
      [492, 1429],
      [318, 1429],
      [318, 1546],
    ],
  ],
  '410',
  '410',
);
templatePolygonFeature(
  [
    [
      [239, 1409],
      [306, 1409],
      [306, 1325],
      [239, 1325],
      [239, 1409],
    ],
  ],
  '300 (компьютерный класс, <br> находится между 3 и 4 этажами)',
  '300',
);
templatePolygonFeature(
  [
    [
      [178, 1320],
      [475, 1320],
      [475, 987],
      [178, 987],
      [178, 1320],
    ],
  ],
  '409 (деканат экономического факультета, заочное отделение)',
  '409',
);
templatePolygonFeature(
  [
    [
      [178, 983],
      [475, 983],
      [475, 785],
      [178, 785],
      [178, 983],
    ],
  ],
  '408 (деканат экономического факультета, дневное отделение)',
  '408',
);
templatePolygonFeature(
  [
    [
      [178, 782],
      [475, 782],
      [475, 685],
      [178, 685],
      [178, 782],
    ],
  ],
  '407 (серверная)',
  '407',
);
templatePolygonFeature(
  [
    [
      [178, 682],
      [475, 682],
      [475, 481],
      [178, 481],
      [178, 682],
    ],
  ],
  '406 (научно-образовательный центр экономического факультета)',
  '406',
);
templatePolygonFeature(
  [
    [
      [178, 478],
      [475, 478],
      [475, 610],
      [633, 610],
      [633, 374],
      [511, 374],
      [511, 255],
      [178, 255],
      [178, 478],
    ],
  ],
  '405 (деканат экономического факультета)',
  '405',
);
templatePolygonFeature(
  [
    [
      [886, 1097],
      [1073, 1097],
      [1073, 778],
      [886, 778],
      [886, 1097],
    ],
  ],
  '413 (учебная лаборатория Базальт СПО, компьютерный класс)',
  '413',
);
templatePolygonFeature(
  [
    [
      [1076, 1097],
      [1244, 1097],
      [1244, 778],
      [1076, 778],
      [1076, 1097],
    ],
  ],
  '414 (учебная лаборатория Совкомбанк, компьютерный класс)',
  '414',
);
templatePolygonFeature(
  [
    [
      [1247, 1097],
      [1458, 1097],
      [1458, 778],
      [1247, 778],
      [1247, 1097],
    ],
  ],
  '415 (учебная лаборатория искусственного интеллекта, машинного обучения, <br> компьютерный класс)',
  '415',
);
templatePolygonFeature(
  [
    [
      [632, 631],
      [918, 631],
      [918, 373],
      [632, 373],
      [632, 631],
    ],
  ],
  '404',
  '404',
);
templatePolygonFeature(
  [
    [
      [921, 631],
      [1163, 631],
      [1163, 373],
      [921, 373],
      [921, 631],
    ],
  ],
  '403 (компьютерный класс экономического факультета)',
  '403',
);
templatePolygonFeature(
  [
    [
      [1166, 631],
      [1361, 631],
      [1361, 373],
      [1166, 373],
      [1166, 631],
    ],
  ],
  '402 (компьютерный класс экономического факультета)',
  '402',
);
templatePolygonFeature(
  [
    [
      [1364, 635],
      [1518, 635],
      [1518, 373],
      [1364, 373],
      [1364, 635],
    ],
  ],
  '401 (учебная лаборатория информационных технологий в экономике)',
  '401',
);
templatePolygonFeature(
  [
    [
      [1521, 635],
      [1816, 635],
      [1816, 373],
      [1521, 373],
      [1521, 635],
    ],
  ],
  '433 (лекционная аудитория)',
  '433',
);

// аудитории правого крыла
templatePolygonFeature(
  [
    [
      [2894, 1948],
      [3315, 1948],
      [3315, 1719],
      [2894, 1719],
      [2894, 1948],
    ],
  ],
  '420',
  '420',
);
templatePolygonFeature(
  [
    [
      [2894, 1717],
      [3193, 1717],
      [3193, 1630],
      [2894, 1630],
      [2894, 1717],
    ],
  ],
  '422 (образовательный центр <br> непрерывной подготовки <br> IT-специалистов)',
  '422',
);
templatePolygonFeature(
  [
    [
      [2894, 1628],
      [3193, 1628],
      [3193, 1552],
      [2894, 1552],
      [2894, 1628],
    ],
  ],
  '423',
  '423',
);
templatePolygonFeature(
  [
    [
      [2894, 1550],
      [3310, 1550],
      [3310, 1320],
      [2894, 1320],
      [2894, 1550],
    ],
  ],
  '424',
  '424',
);
templatePolygonFeature(
  [
    [
      [2894, 1318],
      [3193, 1318],
      [3193, 932],
      [2894, 932],
      [2894, 1318],
    ],
  ],
  '426',
  '426',
);
templatePolygonFeature(
  [
    [
      [2894, 568],
      [3193, 568],
      [3193, 929],
      [2894, 929],
      [2894, 568],
    ],
  ],
  '427 (кафедра финансов <br> и кредита)',
  '427',
);
templatePolygonFeature(
  [
    [
      [2894, 565],
      [3193, 565],
      [3193, 251],
      [2863, 251],
      [2863, 373],
      [2894, 373],
      [2894, 565],
    ],
  ],
  '428 (кафедра <br> экономической теории и <br> национальной экономики)',
  '428',
);
templatePolygonFeature(
  [
    [
      [2303, 1097],
      [2488, 1097],
      [2488, 778],
      [2303, 778],
      [2303, 1097],
    ],
  ],
  '418 (компьютерный класс факультета КНиИТ)',
  '418',
);
templatePolygonFeature(
  [
    [
      [2166, 1097],
      [2300, 1097],
      [2300, 778],
      [2166, 778],
      [2166, 1097],
    ],
  ],
  '417 (лаборатория системного программирования)',
  '417',
);
templatePolygonFeature(
  [
    [
      [1915, 1097],
      [2163, 1097],
      [2163, 778],
      [1915, 778],
      [1915, 1097],
    ],
  ],
  '416 (компьютерный класс факультета КНиИТ)',
  '416',
);
templatePolygonFeature(
  [
    [
      [2507, 635],
      [2749, 635],
      [2749, 373],
      [2507, 373],
      [2507, 635],
    ],
  ],
  '429',
  '429',
);
templatePolygonFeature(
  [
    [
      [2233, 635],
      [2504, 635],
      [2504, 373],
      [2233, 373],
      [2233, 635],
    ],
  ],
  '430',
  '430',
);
templatePolygonFeature(
  [
    [
      [1998, 635],
      [2230, 635],
      [2230, 373],
      [1998, 373],
      [1998, 635],
    ],
  ],
  '431',
  '431',
);
templatePolygonFeature(
  [
    [
      [1819, 635],
      [1995, 635],
      [1995, 373],
      [1819, 373],
      [1819, 635],
    ],
  ],
  '432',
  '432',
);

// специальные помещения
templatePolygonFeature(
  [
    [
      [1680, 1465],
      [1820, 1465],
      [1820, 1230],
      [1680, 1230],
      [1680, 1465],
    ],
  ],
  'раздевалка мужская',
  'lockerroommale',
);
templatePolygonFeature(
  [
    [
      [1538, 1465],
      [1677, 1465],
      [1677, 1230],
      [1538, 1230],
      [1538, 1465],
    ],
  ],
  'раздевалка женская',
  'lockerroomfemale',
);

const map = createMap('fourth_floor.svg');

const popup = createPopup();
map.addOverlay(popup);

pointermove(map, defaultStyle, highlightStyle, popup);
click(map, show_schedule);

setupGlobalFilters(4);
